var config = {
  /*在这里配置你的基本信息，所有数据以字符串形式给出*/
  name: "宋子文",
  sex: "男",
  age: "18",
  phone: "17686907900",
  email: "ziwensong.cs@gmail.com",
  address: "现居北京",
  qq: "750272783",
  log: "个人简历",
  excpect_work: "前端开发",

  /*在这里配置首页的座右铭集合*/
  motto: [
    "明天不一定会更好，但要坚信更好的明天一定会来。",
    "要做的事情总找得出时间和机会，不愿意做的事情也总能找得出借口。",
    "Gor For It!",
    "有智者立长志，无志者长立志。",
    "那些过去的眼泪终将风干在记忆里。",
    "真相，是为了剿灭幻想。",
    "我欲将心向明月，奈何明月照沟渠。",
    "春风得意马蹄疾，一日看尽长安花。",
    "天凉好个秋！",
    "老骥伏枥，志在千里。烈士暮年，壮心不已。",
    "老当益壮，宁移白首之心。穷且益坚，不坠青云之志。",
    "我们必须拿我们所有的， 去换我们所没有的",
    "蒹葭苍苍，白露为霜；所谓伊人，在水一方。",
    "数风流人物，还看今朝！",
  ],

  /*在这里配置首页的见面信息，你可以内嵌HTML标签以调整格式*/
  welcome:
    "青青子衿，悠悠我心<br>" +
    "但为君故，沉吟至今<br>" +
    "你好，我是宋子文，中央民族大学大一学生<br>" +
    "很高兴见到你!",

  /*在这里配置关于我的信息，你可以内嵌HTML标签以调整格式*/
  about:
    "<p>你好！我叫宋子文，性别男，中央民族大学大一在读。</p>" +
    "<p>我有着较多的前端编程经验，同时掌握Python的基础应用。计算机基础知识掌握扎实，能熟练使用github和git" +
    "<p>十分期待与您的联系!</p>",

  /**
   * 在这里配置你的技能点
   * ["技能点", 掌握程度, "技能条颜色"]
   */
  skills: [
    ["HTML5", 80, "red"],
    ["CSS3", 77, "blue"],
    ["JavaScript", 75, "#1abc9c"],
    ["C", 67, "rgba(0,0,0)"],
    // ["CSS3", 60, "yellow"],
    ["Python", 70, "pink"],
  ],

  /*这里填写你的技能描述，你可以内嵌HTML标签以调整格式*/
  skills_description:
    "<ul>" +
    "     <li>操作系统、计算机网络等编程基础知识良好。</li>" +
    "     <li>掌握Python基础。</li>" +
    "     <li>了解Git工具和Github的使用</li>" +
    "     <li>熟悉HTML、CSS、JavaScript以及相应前端知识。</li>" +
    "     <li>掌握C语言基础</li>" +
    "     <li>高数等专业课基础扎实</li>" +
    " </ul>",

  /**
   * 这里填写你的个人作品展示
   * ["img"，"url", "ProjectName", "brief"]
   * img表示您的作品图片链接，url表示您的项目地址，ProjectName表示您的仓库或作品名称，brief是一句简短的介绍
   * 通过查看实际效果以调整字题长度
   */
  portfolio: [
    [
      "./images/pro-2.png",
      "https://github.com/FoundDream/",
      "个人简历",
      "采用HTML,CSS,Javascript编写的个人简历<br>2024/3/10",
    ],
  ],

  /**
   * 这里填写您的工作经历
   * ["日期"， "工作"， "介绍"]
   * 你可以内嵌HTML标签以排版格式
   */
  work: [
    //如果您内有工作经历，您可以采取下列写法
    // ["————————", "", "<p>暂无工作经历，期待您的联系。</p>"]

    [
      "2020/9/1 — 2023/6/10",
      "<br>临沂一中学生",
      "<p><strong>已毕业</strong></p>" + "<p>-</p>" + "<p>-</p>",
    ],

    [
      "2023/9/1 — 至今",
      "<br>中央民族大学",
      "<p><strong>在读</strong></p>" +
        "<p>CET4——596分</p>" +
        "<p>无挂科，违纪记录</p>",
    ],
  ],

  /**
   * 这里填写你的其他经历
   * ["日期"， "经历"， "介绍"]
   * 建议填写您的校级及以上得奖经历或或其他证书
   */
  others: [
    // [
    //   "2021-04-28",
    //   "第十二届蓝桥杯大学生A组省三等奖",
    //   "大一下学期，我参与第十二届蓝桥杯大学生A组，然比赛一改以往暴力题，半数以上DP，仅取得省级三等奖。",
    // ],
    // [
    //   "2021-04-24",
    //   "第六届团队程序设计天梯赛个人国家三等奖",
    //   "大一下学期，我通过面向全年级的选拔，获得入队名额，在个人赛中获得全国三等奖。",
    // ],
    // [
    //   "2021-04-24",
    //   "第六届团队程序设计天梯赛团体国家二等奖",
    //   "大一下学期，我通过面向全年级的选拔，获得入队名额，跟随团队取得团体国家二等奖的成绩。",
    // ],
    // [
    //   "2020-11-14",
    //   "2020级南昌大学程序设计正式赛三等奖",
    //   "大一上学期，我参与校举办的面向全校程序设计大赛并获得三等奖，",
    // ],
  ],

  /**
   * 在这里填写您的社交网络平台
   * ["img", "url", "desc"]
   * img是社交平台的图标，在./svg目录下我们已经准备好了 微博、简书、掘金、小红书、知乎、csdn、facebook、github、力扣、CF和qq的图标
   * url是您链接
   * desc是一段描述，将鼠标移入将会显示该描述
   * 建议您放置数量 <= 5
   */
  icon: [
    ["./svg/LeetCode.svg", "#", "我的力扣主页"],
    ["./svg/github.svg", "https://github.com/founddream", "我的GitHub主页"],
    ["./svg/博客.svg", "www.ziwen.xyz", "我的个人博客"],
    ["./svg/掘金.svg", "#", "我的掘金主页"],
    [
      "./svg/知乎.svg",
      "hhttps://www.zhihu.com/people/dream-28-77",
      "我的知乎主页",
    ],
  ],

  //这是一些图片链接，建议您仅更改第二个头像图片
  url: [
    //背景图、头像、作品展示背景、其他经历背景
    "./images/intro-bg.jpg",
    "./images/2.jpg",
    "./images/work-bk.png",
    "./images/4.jpg",
  ],
};
